# Crack the Code - Session 3

## Exercises based on Lists

Question - Given a Python list, remove all occurrence of 20 from the list  
list1 = [5, 20, 15, 20, 25, 50, 20]

In [9]:
list1 = [5, 20, 15, 20, 25, 50, 20]

def removeValue(sampleList, val):
   return [value for value in sampleList if value != val]
resList = removeValue(list1, 20)
print(resList)

[5, 15, 25, 50]

Question  - Concatenate two lists in the following order  
list1 = ["Hello ", "take "]  
list2 = ["Dear", "Sir"]  
Expected output - ['Hello Dear', 'Hello Sir', 'take Dear', 'take Sir']

In [ ]:
list1 = ["Hello ", "take "]
list2 = ["Dear", "Sir"]

resList = [x+y for x in list1 for y in list2]
print(resList)

Question - Given a two Python list. Iterate both lists simultaneously such that list1 should display item in original order and list2 in reverse order  
list1 = [10, 20, 30, 40]  
list2 = [100, 200, 300, 400]  

Expected output:   
10 400   
20 300    
30 200    
40 100

In [2]:
list2 = [100, 200, 300, 400]
list2[::-1] # list[start:stop:step]

[400, 300, 200, 100]

In [3]:
list1 = [10, 20, 30, 40]
list2 = [100, 200, 300, 400]
for x,y in zip(list1, list2):
    print(x,y)

10 100
20 200
30 300
40 400

In [4]:
list1 = ['Hello', 'Bye']
list2 = ['Luca', 'Sami']
list3 = 

for x,y in zip(list1, list2):
    print(x,y)

Hello Luca
Bye Sami

In [ ]:
list1 = [10, 20, 30, 40]
list2 = [100, 200, 300, 400]

for x, y in zip(list1, list2[::-1]):
    print(x, y)

## Generators

In [1]:
def square_numbers(nums):
    result = []
    for i in nums:
      result.append(i*i)
    return result

In [2]:
my_nums = square_numbers([1,2,3,4,5])
my_nums

[1, 4, 9, 16, 25]

In [3]:
# Generator method 
def square_numbers(nums):
    for i in nums:
        yield (i*i)

my_nums = square_numbers([1,2,3,4,5])
my_nums

In [4]:
for num in my_nums:
    print(num)

1
4
9
16
25

In [5]:
# Generator comprehension 
my_nums = (x*x for x in [1,2,3,4,5])
my_nums

## Pandas

In [ ]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [ ]:
# Loading the data 
train = pd.read_csv('titanic_train.csv')
train.head()

In [ ]:
# Missing values 
# Identifying the columns with missing values using heatmap from Seaborn 

sns.heatmap(train.isnull(), yticklabels=False, cbar=False, cmap='viridis')

From the above heatmap, we can observe that only the columns Age and Cabin have missing values. Cabin has too many missing values for imputation or replacement.

# Additional Exercises

## Extra Pandas Questions

In [2]:
# Importing Libraries 
import pandas as pd

In [2]:
myStudents = pd.DataFrame({
    'name' : ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'],
    'age'  : [21, 22, 23, 24, 25, 26, 27, 28],
    'gpa'  : [4.0, 4.5, 5.0, 5.5, 6.0, 6.5, 7.0, 7.5]
})
myStudents  # this  chunk of code is for creating dataframes

  name  age  gpa
0    A   21  4.0
1    B   22  4.5
2    C   23  5.0
3    D   24  5.5
4    E   25  6.0
5    F   26  6.5
6    G   27  7.0
7    H   28  7.5

## Filter by Row

Question - Select only students with age between 23 and 25 included.

In [3]:
myStudents[ (myStudents['age'] >= 23) & (myStudents['age']<=25) ]

  name  age  gpa
2    C   23  5.0
3    D   24  5.5
4    E   25  6.0

## Select Columns

Question - Select only the columns gpa and age

In [ ]:
mystudentsgpa=myStudents[['gpa','age']]

In [3]:
df = pd.read_csv('california_housing.csv', index_col=0)

In [4]:
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0

## Question 1 - How many rows and columns do we have?

In [28]:
df.shape

(17000, 9)

Some useful functions to remember are:

describe(): Summary statistics for each column of the dataset.  
head(): Print the first 5 rows of the dataset.  
tail(): Print the last 5 rows of the dataset.  
dtypes: Type of variable in each column.  
shape: Number of rows (shape[0]) and columns (shape[1]).

## Question 2 -  Find the most expensive house block, using variable median_house_value

In [5]:
# method 1: Sort
df.sort_values(by=['median_house_value'], ascending=False).head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
8628,-118.53,34.14,28.0,6920.0,906.0,2515.0,860.0,9.2189,500001.0
4398,-118.03,34.16,36.0,1640.0,239.0,693.0,253.0,6.6888,500001.0
8653,-118.54,34.05,33.0,6778.0,1092.0,2540.0,1052.0,8.5650,500001.0
8652,-118.54,34.06,21.0,3755.0,525.0,1493.0,526.0,11.4233,500001.0
4334,-118.01,33.69,3.0,945.0,115.0,337.0,123.0,11.5199,500001.0

In [6]:
# method 2: argmax (idxmax)
df['median_house_value'].idxmax()

215

## Question 3 - Select blocks with no more than 1000 rooms. How many observations do we have?

In [7]:
df1000 = df[df['total_rooms'] <= 1000]
df1000.shape

(1887, 9)

## Question 4 - Create a new column, called income_group, and assign values as follows  
### Assign 'H' to blocks with median income above the average median income.    
### Assign 'L' to blocks with median income below the average median income.

In [ ]:
import numpy as np
avg = df['median_income'].mean()
print("The avg median income is {0}.".format(avg))

In [ ]:
df['income_group'] = np.where(df['median_income'] >= avg, 'H', 'L')
df.head()

Question 1 - A generator for the fibonacci series, where:  
       Fib[0] = 0  
       Fib[1] = 1  
       Fib[n+2] = Fib[n] + Fib[n+1]  
       until the 10th fibonacci number

Question 2 - Given a List, extract all elements whose frequency is greater than K.  
Input : test_list = [4, 6, 4, 3, 3, 4, 3, 4, 3, 8], K = 3  
Output : [4, 3]  
Explanation : Both elements occur 4 times.  

Input : test_list = [4, 6, 4, 3, 3, 4, 3, 4, 6, 6], K = 2  
Output : [4, 3, 6]  
Explanation : Occur 4, 3, and 3 times respectively.

In [ ]:
Question 3 -